Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: Version 1.80: Freedom 1 must be practical, not just theoretical; i.e., no tivoization.
de: Version 1.80: Freiheit 1 muss nicht nur theoretisch, sondern praktisch umsetzbar sein; d. h. keine Tivoisierung.

source: Version 1.77: Clarify that all retroactive changes to the license are unacceptable, even if it's not described as a complete replacement.
de: Version 1.77: Klarstellung, dass alle nachträglichen Lizenzänderungen inakzeptabel sind, auch wenn nicht als vollständiger Ersatz beschrieben.

source: Version 1.74: Four clarifications of points not explicit enough, or stated in some places but not reflected everywhere: "Improvements" does not mean the license can substantively limit what kinds of modified versions you can release.
de: Version 1.74: Vier Klarstellungen von Punkten, die nicht explizit genug oder an einigen Stellen angegebenen sind, aber nicht überall reflektiert werden: „Verbesserungen“ bedeutet nicht, dass die Lizenz substantiell einschränken kann, welche Arten von modifizierten Versionen freigegeben werden können.

source: Freedom 3 includes distributing modified versions, not just changes.
de: Freiheit 3 enthält die Verbreitung modifizierter Versionen, nicht nur deren Änderungen.

source: The right to merge in existing modules refers to those that are suitably licensed.
de: Das Recht, vorhandene Module zusammenzufügen, bezieht sich auf entsprechend lizenzierte Module.

source: Explicitly state the conclusion of the point about export controls.
de: Ausdrücklich die Schlussfolgerung des Punktes über Exportkontrolle.

source: Imposing a license change constitutes revoking the old license.
de: Einführung einer Lizenzänderung führt zur Aufhebung der alten Lizenz.

source: Version 1.57: Add "Beyond Software" section.
de: Version 1.57: Abschnitt Jenseits von Software hinzugefügt.

source: Version 1.46: Clarify whose purpose is significant in the freedom to run the program for any purpose.
de: Version 1.46: Klarstellung des für die Freiheit bedeutsamen Ziels, das Programm für jeden Zweck auszuführen.

source: Version 1.41: Clarify wording about contract-based licenses.
de: Version 1.41: Klarstellung zum Wortlaut vertraglich geregelter Lizenzen.

source: Version 1.40: Explain that a free license must allow to you use other available free software to create your modifications.
de: Version 1.40: Erklärung, dass eine freie Lizenz erlauben muss, andere verfügbare Freie Software zu verwenden, um eigene Modifizierungen vorzunehmen.

source: Version 1.39: Note that it is acceptable for a license to require you to provide source for versions of the software you put into public use.
de: Version 1.39: Es ist akzeptabel, wenn eine Lizenz erfordert, den Quellcode für von Ihnen für die öffentliche Nutzung bereitgestellte Softwareversionen zur Verfügung zu stellen.

source: Version 1.31: Note that it is acceptable for a license to require you to identify yourself as the author of modifications. Other minor clarifications throughout the text.
de: Version 1.31: Es ist akzeptabel, wenn eine Lizenz erfordert, sich als Autor von Modifikationen zu identifizieren sowie weitere geringfügige Klarstellungen.

source: Version 1.23: Address potential problems related to contract-based licenses.
de: Version 1.23: Potenzielle Probleme im Zusammenhang mit vertragsbasierten Lizenzen.

source: Version 1.16: Explain why distribution of binaries is important.
de: Version 1.16: Erklärung, warum der Vertrieb von Binärdateien wichtig ist.

source: Version 1.11: Note that a free license may require you to send a copy of versions you distribute to previous developers on request.
de: Version 1.11: Hinweis, dass eine freie Lizenz vorschreiben kann, auf Nachfrage früherer Entwickler eine Kopie der von Ihnen distribuierten Varianten zu übersenden.

source: There are gaps in the version numbers shown above because there are other changes in this page that do not affect the definition or its interpretations.
de: Aufgrund anderer Änderungen an diesem Dokument, die die Definition oder deren Interpretationen selbst nicht beeinflussen, gibt es Lücken in den Versionsnummern.

source: For instance, the list does not include changes in asides, formatting, spelling, punctuation, or other parts of the page.
de: Beispielsweise sind keine Änderungen wie Nebenbemerkungen, Formatierung, Rechtschreibung, Zeichensetzung oder andere aufgeführt.

source: You can review the complete list of changes to the page through the cvsweb interface.
de: Eine vollständige Übersicht aller Änderungen sind mit Hilfe der CVSweb-Oberflächezu finden.

source: Footnote The reason they are numbered 0, 1, 2 and 3 is historical.
de: Anmerkung [1] Der Grund, warum die vier Freiheiten mit 0, 1, 2 und 3 nummeriert sind, ist historisch bedingt.

source: Around 1990 there were three freedoms, numbered 1, 2 and 3. Then we realized that the freedom to run the program needed to be mentioned explicitly.
de: Um 1990 gab es drei Freiheiten, nummeriert mit 1, 2 und 3. Dann wurde klar, dass die Freiheit, das Programm für jeglichen Zweck auszuführen, explizit erwähnt werden musste.

source: It was clearly more basic than the other three, so it properly should precede them.
de: Diese Freiheit war deutlich elementarer als die anderen drei, sollte also entsprechend vorangestellt sein.

source: Rather than renumber the others, we made it freedom 0.
de: Anstatt die anderen nun umzubenennen, wurde sie dem folgend Freiheit 0 benannt.

source: Free Software Is Even More Important Now by Richard Stallman
de: Freie Software ist jetzt sogar noch wichtiger von Richard Stallman

source: A substantially edited version of this article was published in Wired.
de: Eine im Wesentlichen gleiche Fassung dieses Artikels ist in der Zeitschrift Wired im September 2013 erschienen.

source: Suggested ways you can help the free software movement
de: Vorschläge, wie man die Freie-Software-Bewegung unterstützen kann

source: Since 1983, the Free Software Movement has campaigned for computer users' freedom—for users to control the software they use, rather than vice versa.
de: Seit 1983 setzt sich die Free Software Foundation (FSF) für die Freiheit von Rechnernutzern ein, damit diese die von ihnen genutzte Software kontrollieren, und nicht umgekehrt.

source: When a program respects users' freedom and community, we call it “free software.”
de: Wenn ein Programm Freiheit und Gemeinschaft von Nutzern respektiert, nennen wir es “Freie Software.”

source: We also sometimes call it “libre software” to emphasize that we're talking about liberty, not price.
de: Manchmal nennen wir sie auch Libre Software, um hervorzuheben, dass wir über Freiheit sprechen, nicht über den Preis.

source: Some proprietary (nonfree) programs, such as Photoshop, are very expensive; others, such as Flash Player, are available gratis—but that's a minor detail.
de: Einige proprietäre ‑ unfreie ‑ Programme, wie Photoshop, sind sehr teuer; andere, wie Flash Player, sind gratis verfügbar ‑ aber das ist nur ein unwichtiges Detail.

source: Either way, they give the program's developer power over the users, power that no one should have.
de: So oder so geben sie dem Programmentwickler Macht über die Nutzer, Macht, die niemand haben sollte.

source: Those two nonfree programs have something else in common: they are both malware.
de: Diese beiden unfreien Programme haben noch etwas anderes gemein: beide sind Schadsoftware.

source: That is, both have functionalities designed to mistreat the user.
de: Das heißt, beide verfügen über Funktionen, um den Nutzer schlecht zu behandeln.

source: Proprietary software nowadays is often malware because the developers' power corrupts them.
de: Proprietäre Software ist heutzutage häufig Schadsoftware, weil die Macht der Entwickler sie dazu verleitet.

source: That directory lists around 450 different malicious functionalities (as of January, 2020), but it is surely just the tip of the iceberg.
de: Diese Übersicht führt rund 400 verschiedene bösartige Funktionen auf (Stand: April 2019), aber es ist sicherlich nur die Spitze des Eisbergs.

source: With free software, the users control the program, both individually and collectively.
de: Mit freier Software kontrollieren Nutzer das Programm sowohl individuell als auch kollektiv.

source: So they control what their computers do (assuming those computers are loyal and do what the users' programs tell them to do).
de: Damit kontrollieren sie also, was ihre Rechner tun (vorausgesetzt diese Rechner verhalten sich loyal und tun das, was die Programme der Nutzer ihnen vorgeben).

source: With proprietary software, the program controls the users, and some other entity (the developer or “owner”) controls the program.
de: Bei proprietärer Software kontrolliert das Programm die Nutzer und eine andere Entität (der Entwickler oder „Eigentümer“) kontrolliert das Programm.

source: So the proprietary program gives its developer power over its users.
de: Somit gibt das proprietäre Programm seinen Entwicklern Macht über deren Nutzer.

source: That is unjust in itself; moreover, it tempts the developer to mistreat the users in other ways.
de: Das an sich ist schon ungerecht und verleitet Entwickler außerdem dazu, Nutzer auch auf andere Weise schlecht zu behandeln.

source: Even when proprietary software isn't downright malicious, its developers have an incentive to make it addictive, controlling and manipulative.
de: Selbst wenn proprietäre Software nicht gerade bösartig ist, haben ihre Entwickler einen Anreiz, sie süchtig, kontrollierend und manipulativ.zu machen.

source: You can say, as does the author of that article, that the developers have an ethical obligation not to do that, but generally they follow their interests.
de: Man kann sagen, wie der Autor dieses Artikels, dass die Entwickler eine ethische Verpflichtung haben das nicht zu tun, aber im Allgemeinen folgen sie eigenen Interessen.

source: If you want this not to happen, make sure the program is controlled by its users.
de: Damit das nicht geschieht, sollte man sicherstellen, dass das Programm von seinen Nutzern kontrolliert wird.

source: Freedom means having control over your own life.
de: Freiheit bedeutet, die Kontrolle über das eigene Leben zu haben.

source: If you use a program to carry out activities in your life, your freedom depends on your having control over the program.
de: Wenn man ein Programm verwendet, um damit Aktivitäten im Leben zu verrichten, hängt die eigene Freiheit davon ab, dass man die Kontrolle über das Programm hat.

source: You deserve to have control over the programs you use, and all the more so when you use them for something important in your life.
de: Jeder verdient die Kontrolle über genutzte Programme, und das umso mehr, wenn sie für wichtige Lebensbereiche benutzt werden.

source: Users' control over the program requires four essential freedoms.
de: Die Nutzerkontrolle über das Programm erfordert vier wesentliche Freiheiten.

source: (0) The freedom to run the program as you wish, for whatever purpose.
de: (0) Die Freiheit, das Programm auszuführen wie man möchte, für welchen Zweck auch immer.

source: (1) The freedom to study the program's “source code”, and change it, so the program does your computing as you wish.
de: (1) Die Freiheit, den Quellcode des Programms zu untersuchen und zu ändern, sodass das Programm die Datenverarbeitung so vornimmt wie man möchte.

source: Programs are written by programmers in a programming language—like English combined with algebra—and that form of the program is the “source code”.
de: Programme werden von Programmierern in einer Programmiersprache geschrieben ‑ wie Englisch in Verbindung mit Algebra ‑ und diese Programmform ist der Quellcode.

source: Anyone who knows programming, and has the program in source code form, can read the source code, understand its functioning, and change it too.
de: Wer sich mit Programmierung auskennt und das Programm in Form von Quellcode vorliegen hat, kann den Quellcode lesen, seine Funktionsweise verstehen und ebenso ändern.

source: When all you get is the executable form, a series of numbers that are efficient for the computer to run but extremely hard for a human being to understand, understanding and changing the program in that form are forbiddingly hard.
de: Wenn alles, was man erhält, die ausführbare Form ist, eine Zahlenreihe, für den Betrieb des Rechners effizient, für einen Menschen jedoch extrem schwer verstehbar, sind Verstehen und Programmänderung unerhört schwer.

source: (2) The freedom to make and distribute exact copies when you wish.
de: (2) Die Freiheit, exakte Kopien zu erstellen und zu verteilen, wenn man möchte.

source: (It is not an obligation; doing this is your choice.
de: (Das ist keine Verpflichtung, es ist Ihre Entscheidung.

source: If the program is free, that doesn't mean someone has an obligation to offer you a copy, or that you have an obligation to offer him a copy.
de: Wenn das Programm frei ist, bedeutet das noch lange nicht, dass jemand eine Verpflichtung hat, Ihnen eine Kopie anzubieten, oder dass Sie eine Verpflichtung haben, jemanden eine Kopie anzubieten.

source: Distributing a program to users without freedom mistreats them; however, choosing not to distribute the program—using it privately—does not mistreat anyone.)
de: Ein Programm an Benutzer ohne Freiheit zu verteilen, behandelt sie schlecht. Allerdings kann die Entscheidung, das Programm nicht zu verteilen ‑ es privat zu benutzen ‑ niemanden schlecht behandeln.

source: (3) The freedom to make and distribute copies of your modified versions, when you wish.
de: (3) Die Freiheit, Kopien eigener modifizierter Versionen zu erstellen und zu verteilen, wenn man möchte.

source: The first two freedoms mean each user can exercise individual control over the program.
de: Die ersten beiden Freiheiten bedeuten, dass jeder Nutzer individuelle Kontrolle über das Programm ausüben kann.

source: With the other two freedoms, any group of users can together exercise collective control over the program.
de: Mit den anderen beiden Freiheiten kann jede Nutzergruppe zusammen kollektive Kontrolle über das Programm ausüben.

source: With all four freedoms, the users fully control the program.
de: Mit allen vier Freiheiten kontrollieren die Nutzer das Programm gänzlich.

source: If any of them is missing or inadequate, the program is proprietary (nonfree), and unjust.
de: Falls irgendeine von ihnen fehlt oder unzureichend ist, ist das Programm proprietär (unfrei) und ungerecht.

source: Other kinds of works are also used for practical activities, including recipes for cooking, educational works such as textbooks, reference works such as dictionaries and encyclopedias, fonts for displaying paragraphs of text, circuit diagrams for hardware for people to build, and patterns for making useful (not merely decorative) objects with a 3D printer.
de: Andere Arten von Werken werden auch für praktische Tätigkeiten benutzt, einschließlich Kochrezepte, pädagogische Werke wie Lehrbücher, Nachschlagewerke wie Wörterbücher und Enzyklopädien, Schriftarten zum Anzeigen von Textpassagen, Schaltpläne von Hardware zum Nachbauen und Muster zur Herstellung nützlicher (nicht nur dekorativer) Objekte mit einem 3D-Drucker.

source: Since these are not software, the free software movement strictly speaking doesn't cover them; but the same reasoning applies and leads to the same conclusion: these works should carry the four freedoms.
de: Da es sich nicht um Software handelt, erstreckt sich die Freie-Software-Bewegung streng genommen nicht auf sie, doch die gleiche Überlegung gilt und führt zu dem gleichen Ergebnis: diese Werke sollten die vier Freiheiten mit sich bringen.

source: A free program allows you to tinker with it to make it do what you want (or cease to do something you dislike).
de: Ein freies Programm ermöglicht es daran herumzubasteln, damit es tut, was man möchte (oder aufhört etwas zu tun, was man nicht mag).

source: Tinkering with software may sound ridiculous if you are accustomed to proprietary software as a sealed box, but in the Free World it's a common thing to do, and a good way to learn programming.
de: An Software herumzubasteln mag sich lächerlich anhören, wenn man proprietäre Software als versiegelten Kasten gewohnt ist, doch in der freien Welt ist es üblich und ein guter Weg das Programmieren zu lernen.

source: Even the traditional American pastime of tinkering with cars is obstructed because cars now contain nonfree software.
de: Sogar der traditionelle amerikanische Zeitvertreib, an Autos basteln, ist gehemmt, da Autos nun unfreie Software enthalten.

source: The Injustice of Proprietariness If the users don't control the program, the program controls the users.
de: Die Ungerechtigkeit von Proprietät Wenn die Nutzer nicht das Programm kontrollieren, kontrolliert das Programm die Nutzer.

source: With proprietary software, there is always some entity, the developer or “owner” of the program, that controls the program—and through it, exercises power over its users.
de: Bei proprietärer Software gibt es immer jemanden, den Entwickler oder „Eigentümer‘ des Programms, der das Programm kontrolliert ‑ und dadurch Macht über seine Nutzer ausübt.

source: A nonfree program is a yoke, an instrument of unjust power.
de: Ein unfreies Programm ist ein Joch, ein Instrument der ungerechten Macht.

source: In outrageous cases (though this outrage has become quite usual) proprietary programs are designed to spy on the users, restrict them, censor them, and abuse them.
de: In ausschreitenden Fällen (obwohl diese Ausschreitungen ganz normal geworden sind) werden proprietäre Programme entworfen, um die Nutzer auszuspähen, sie einzuschränken, sie zu zensieren und sie zu missbrauchen.

source: For instance, the operating system of Apple iThings does all of these, and so does Windows on mobile devices with ARM chips.
de: Das Betriebssystem der Apple iDinger zum Beispiel tut all dies, und Windows macht es ebenso mit ARM-Chips auf mobilen Geräten.

source: Windows, mobile phone firmware, and Google Chrome for Windows include a universal back door that allows some company to change the program remotely without asking permission.
de: Windows-Smartphone-Firmware und Google Chrome für Windows beinhalten eine universelle Hintertür, die einem Unternehmen erlaubt, das Programm aus der Ferne zu ändern, ohne um Erlaubnis zu fragen.

source: The Amazon Kindle has a back door that can erase books.
de: Der Amazon Kindle hat eine Hintertür, die Bücher löschen kann.

source: The use of nonfree software in the “internet of things” would turn it into the “internet of telemarketers” as well as the “internet of snoopers”.
de: Die Nutzung unfreier Software im „Internet der Dinge“ macht sie sowohl zum „Internet der Telefonverkäufer“ als auch zum „Internet der Schnüffler“.

source: With the goal of ending the injustice of nonfree software, the free software movement develops free programs so users can free themselves.
de: Mit der Absicht, die Ungerechtigkeit von unfreier Software zu beenden, entwickelt die Freie-Software-Bewegung freie Programme, so dass Nutzer sich befreien können.

source: We began in 1984 by developing the free operating system GNU. Today, millions of computers run GNU, mainly in the GNU/Linux combination.
de: Wir begannen 1984 mit der Entwicklung des freien Betriebssystems GNU. Heute führen Millionen von Rechnern GNU aus, vor allem in Kombination mit dem Systemkern Linux, allseits als GNU/Linux bekannt.

source: Distributing a program to users without freedom mistreats those users; however, choosing not to distribute the program does not mistreat anyone.
de: Ein Programm an Nutzer ohne Freiheit weiterzugeben, behandelt diese schlecht; die Entscheidung jedoch, das Programm nicht weiterzugeben, behandelt niemanden schlecht.

source: If you write a program and use it privately, that does no wrong to others.
de: Wenn man ein Programm schreibt und es privat benutzt, tut man anderen gegenüber nichts Falsches (man verpasst eine Gelegenheit etwas Gutes zu tun, doch das ist nicht das selbe wie etwas Falsches zu tun).

source: (You do miss an opportunity to do good, but that's not the same as doing wrong.) Thus, when we say all software must be free, we mean that every copy must come with the four freedoms, but we don't mean that someone has an obligation to offer you a copy.
de: Wenn wir demnach sagen, dass jede Software frei sein muss, meinen wir, dass jede Kopie mit den vier Freiheiten ausgestattet sein muss, doch wir meinen nicht, dass jemand die Pflicht hat, Ihnen eine Kopie anzubieten.

source: Nonfree Software and SaaSS Nonfree software was the first way for companies to take control of people's computing.
de: Unfreie Software und SaaSS Unfreie Software war für Unternehmen der erste Weg, Kontrolle über die Datenverarbeitung der Menschen zu erlangen.

source: Nowadays, there is another way, called Service as a Software Substitute, or SaaSS.
de: Heutzutage gibt es einen anderen Weg namens Service-as-a-Software-Substitute (SaaSS).

source: That means letting someone else's server do your own computing tasks.
de: Das bedeutet, eigene Datenverarbeitungsaufgaben auf einem Server von jemand anderem zu erledigen.

source: SaaSS doesn't mean the programs on the server are nonfree (though they often are).
de: SaaSS bedeutet nicht, dass die Programme auf dem Server unfrei sind (obwohl sie es oft sind).

source: Rather, using SaaSS causes the same injustices as using a nonfree program: they are two paths to the same bad place.
de: Vielmehr verursacht SaaSS die gleichen Ungerechtigkeiten wie ein unfreies Programm: es sind zwei Pfade zum selben schlechten Ort.

source: Take the example of a SaaSS translation service: The user sends text to the server, and the server translates it (from English to Spanish, say) and sends the translation back to the user.
de: Nehmen wir das Beispiel eines SaaSS-Übersetzungsdienstes: der Nutzer sendet Text an einen Server, der Server übersetzt es (etwa aus dem Englischen ins Spanische) und sendet die Übersetzung an den Nutzer zurück.

source: Now the job of translating is under the control of the server operator rather than the user.
de: Jetzt ist die Aufgabe des Übersetzens unter der Kontrolle des Serverbetreibers anstatt beim Nutzer.

source: If you use SaaSS, the server operator controls your computing.
de: Wenn man SaaSS benutzt, kontrolliert der Serverbetreiber die Datenverarbeitung.

source: It requires entrusting all the pertinent data to the server operator, which will be forced to show it to the state as well—who does that server really serve, after all?
de: Es erfordert, dem Serverbetreiber alle relevanten Daten anzuvertrauen, welcher gezwungen sein wird, es dem Staat ebenso zu zeigen ‑ wem dient dieser Server letztendlich wirklich?

source: Primary And Secondary Injustices When you use proprietary programs or SaaSS, first of all you do wrong to yourself, because it gives some entity unjust power over you.
de: Primäre und sekundäre Ungerechtigkeiten Wenn man proprietäre Programme oder SaaSS benutzt, schadet man sich in erster Linie selbst, weil es irgendjemanden ungerechte Macht über einen gibt.

source: For your own sake, you should escape.
de: Um seiner selbst Willen sollte man dem entfliehen.

source: It also wrongs others if you make a promise not to share.
de: Es schadet auch anderen, wenn man ein Versprechen gibt, nicht zu teilen.

source: It is evil to keep such a promise, and a lesser evil to break it; to be truly upright, you should not make the promise at all.
de: Solch ein Versprechen ist ein Übel und das geringere Übel ist, es zu brechen. Für wahrhafte Aufrichtigkeit sollte man das Versprechen erst gar nicht geben.
